####################################################################
###1)while문으로 1~100까지 짝수 합 구하기###########################
###2)while 문으로 1~10까지 각각 홀수와 짝수인지 출력하기############
###3)while 문으로 1~55까지 숫자 중 홀수의 개수 짝수의 개수 구하기###
###4)다음 벡터의 각 원소를 제곱한 결과를 출력하는 코드 작성#########
###                    1,3,5,7,9                                 ###
####################################################################


#문제 1
res1 <- 0
x<-1
while (x<=100) {
  if (x%%2==0){
    res1 <- res1 + x
  }
  x <- x+1
}
print(res1)

#문제2
x1 <- 1
while(x1<=10){
  if (x1%%2==0){
    cat(x1,"짝수\n")
  } else {
    cat(x1,"홀수\n")
  }
  x1 <- x1+1
}

#문제3
cnteven<-0
cntodd<-0
x2<-1
while (x2<=55){
  if(x2%%2==0){
    cnteven <- cnteven+1
  } else {
    cntodd <- cntodd+1
  }
  x2 <- x2 +1
}
cat(cnteven,cntodd)

#문제4
x3<-1
while(x3<=9){
  print(x3**2)
  x3 <- x3+2
}

